cube_tet_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          178;
        startFace       1691;
    }
    inlet
    {
        type            patch;
        nFaces          72;
        startFace       1869;
    }
    outlet
    {
        type            patch;
        nFaces          72;
        startFace       1941;
    }
)

// ************************************************************************* //
