cube_tet_case/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;

    limited         cellLimited Gauss linear 1;
    grad(U)         $limited;
    grad(e)         $limited;
}

divSchemes
{
    default             none;

    div(phi,U)          bounded Gauss linearUpwind limited;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phi,e)          bounded Gauss limitedLinear 1;
    div(phid,p)         Gauss upwind;
    div(phi,Ekp)        bounded Gauss limitedLinear 1;
    div((phi|interpolate(rho)),p) bounded Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p               ;
}
