cube_tet_case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver              GAMG;
        smoother            GaussSeidel;
        tolerance           1e-6;
        relTol              0.1;
    }

    "(U|e|T)"
    {
        solver              smoothSolver;
        smoother            symGaussSeidel;
        tolerance           1e-6;
        relTol              0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    pMinFactor          0.1;
    pMaxFactor          1.5;
    transonic           no;
    consistent          no;

    residualControl
    {
        p               1e-4;
        U               1e-4;
        e               1e-4;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
        rho             0.01;
    }
    equations
    {
        U               0.7;
        e               0.7;
        T               0.7;
    }
}
